#+TITLE: Clojure For The Brave and True Part II -- Chapter 4 Core Functions In Depth
#+DATE: 2025-09-02 Tue
#+AUTHOR: Agung Tuanany
#+DESCRIPTION: Clojure, book, A summary per chapter from book clojure-for-the-brave-and-true.
#+KEYWORDS: programming, clojure, clojure-for-the-brave-and-true.
#+OPTIONS: toc:nil num:nil

if you're fan of the angsty, teenager-centric, quasi-soap opera /the vampire
diaries/ like i am, you'll remember the episode where the lead protagonist,
elena, starts to question her pare, mysterious crush's behavior: "why did he
instantly vanish without a trace when i scraped my knee?" and "how come his face
turned into a grotesque mask of death when i nicked my finger" and so on.

you might be asking yourself similar question if you've started playing with
clojure's core functions, "why did /map/ return a list when i gave it a vector?"
and "how come /reduce/ treats my map like a list if vectors?" and so on. (with
Clojure, though, you're at least spared from contemplating the profound
existential horror of being 17-year-old for eternity.)

in this chapter, you'll learn about clojure's deep, dark, bloodthirsty,
supernatur--*cough*, i mean, in this chapter you'll learn about clojure's
underlying concept of /programming to abstractions/ and about the sequence and
collection abstractions. you'll also learn about /lazy sequences/. this will
give you the grounding you need to read the documentation for functions you
haven't used before and to understand what's happening when you give them a try.

next, you'll get more experience with the function you'll be reaching for the
most. you'll learn how to work with list, vectors, maps, and sets with the
function /map/, /reduce/, /into/, /conj/, /concat/, /concat/, /some/, /filter/,
/take/, /drop/, /sort/, /sort-by/, and /identity/. you'll also learn how to
create new functions with /apply/, /partial/, and /complement/. all this
information will help you understand how to do things the clojure way, ans it
**  map

You've seen many examples of /map/ by now, but this section shows /map/ doing
two new tasks: [1] taking multiple collections as arguments and [2] taking a
collection of functions as an argument. it also highlights a common /map/
pattern: using keywords as the mapping function.

so far, you've only seen examples of /map/ operating on one collection. in the
following code, the collection is the vector /[1 2 3]/:

#+begin_src clojure :result output :exports both eval: never-export
(map inc [1 2 3])
#+end_src

#+results:
: (2 3 4)

however, you can also give /map/ multiple collections. here's a simple example
to show how this works:

#+begin_src clojure :result output :exports both eval: never-export
(map str ["a" "b" "c"] ["a" "b" "c"])
#+end_src

#+results:
: ("aa" "bb" "cc")

it's a /map/ if does the following:

#+begin_src clojure :result output :exports both eval: never-export
(list (str "a" "a") (str "b" "b") (str "c" "c"))
#+end_src

#+results:
: ("aa" "bb" "cc")

when you pass /map/ multiple collections, the elements of the first collection
/(["a" "b" "c"])/ will be passed as the first argument of the mapping function
/(str)/, the elements of the second collection /(["a" "b" "c"]) will be passed
as the second argument, an so on. just be sure that your mapping function can
take a number of arguments equal to the number of collections you're passing to
/map/.

the following example show how you could use this capability if you were a
vampire trying to curb your human consumption. you have two vectors, one
representing human intake in liters and another representing critter intake for
the past four days. the /unify-diet-data/ function takes a single day's data for
both human and critter feeding and unifies the two into a single map:

#+begin_src clojure :result output :exports both eval: never-export
  (def human-consumption   [8.1 7.3 6.6 5.0])
  (def critter-consumption [0.0 0.2 0.3 1.1])

  (defn unify-diet-data
    [human critter]
    {:human human
     :critter critter})

  (map unify-diet-data human-consumption critter-consumption)
#+end_src

#+results:
: ({:human 8.1, :critter 0.0} {:human 7.3, :critter 0.2} {:human 6.6, :critter 0.3} {:human 5.0, :critter 1.1})

good job laying off the human!

another fun thing you can do with /map/ is pass it a collection of functions.
you could use this if you wanted to perform a set of calculations on different
collections of numbers like so:

#+begin_src clojure :result output :exports both eval: never-export
  (def sum #(reduce + %))
  (def avg #(/ (sum %) (count %)))

  (defn stats
    [numbers]
    (map #(% numbers) [sum count avg]))

  (stats [3 4 10])
  ;; => (17 3 17/3)

  (stats [80 1 44 13 6])
  ;; => (144 5 144/5)
#+end_src

in this example, the /stats/ function iterates over a vector of functions,
applying each function to /numbers/.

additionally, clojurists often use /map/ to retrieve the value associated with a
keyword form a collection of map data structures. because keywords can be used
as functions, you can do this succinctly. here's an example:


#+begin_src clojure :result output :exports both eval: never-export
  (def identities
    [{:alias "batman"       :real "bruce wayne"}
     {:alias "spider-man"   :real "peter parker"}
     {:alias "santa"        :real "your mom"}
     {:alias "easter bunny" :real "your dad"}])

  (map :real identities)
#+end_src

#+results:
: ("bruce wayne" "peter parker" "your mom" "your dad")

** reduce

chapter 3 showed how /reduce/ processes each element in a sequence to build a
result. this section shows a couple of other ways to use it that might not be
obvious.

the first use is to transform a map's values, producing a new map with the same
keys but with updated values:

#+begin_src clojure :result output :exports both eval: never-export
  (reduce (fn [new-map [key val]]
            (assoc new-map key (inc val)))
          {}
          {:max 30 :min 10})
#+end_src

#+results:
: {:max 31, :min 11}

in this example, /reduce/ treats the argument /{:max 30 :min 10}/ as a sequence
of vectors, like /([:max 30] [:min 10])/. then, it starts with an empty map (the
second argument) and builds it up using the first argument, an anonymous
function. it's as if /reduce/ does this:

#+begin_src clojure :result output :exports both eval: never-export
  (assoc (assoc {} :max (inc 30))
         :min (inc 10))
#+end_src

#+results:
: {:max 31, :min 11}

another use for /reduce/ is to filter out keys from a map based on their value.
in the following example, the anonymous function checks whether the value of
key-value pair is greather than 4. if it isn't, then the key-value pair is
filtered out. in the map /{:human 4.1 :critter 3.9}/, 3.9 is less that 4, so the
/:critter/ key and its 3.9 value are filtered out.

#+begin_src clojure :result output :exports both eval: never-export
  (reduce (fn [new-map [key val]]
            (if (> val 4)
              (assoc new-map key val)
              new-map))
          {}
          {:human 4.1
           :critter 3.9})
#+end_src

#+results:
: {:human 4.1}

the takeaway here is that /reduce/ is a more flexible function it first appears.
whenever you want to derive a new value from a seqable data structure, /reduce/
will usually be able to do what you need. if you want an exercise that will
really bow your hair back, try implementing /map/ using /reduce/, and then do
the same for/filter/ and /some/ after you read about then in this chapter.

** take, drop, take-while, and drop-while

/take/ and /drop/ both take two arguments: a number and sequence. /take/ returns
the first $n$ elements of the sequence, whereas /drop/ returns the sequence with
the first $n$ elements removed:

#+begin_src clojure :result output :exports both eval: never-export
(take 3 [1 2 3 4 5 6 7 8 9 10])
#+end_src

#+results:
: (1 2 3)

#+begin_src clojure :result output :exports both eval: never-export
(drop 3 [1 2 3 4 5 6 7 8 9 10])
#+end_src

#+results:
: (4 5 6 7 8 9 10)

their cousins /take-while/ and /drop-while/ are bit more interesting. each takes
/predicate function/ (a function whose return is evaluated for truth or falsity)
to determine when it should stop taking or dropping.

suppose, for example, that you ad a vector representing entries in your "food"
journal. each entry has the year, month, day, and what you ate. to preserve
space, we'll only include a few entries:


#+begin_src clojure :result output :exports both eval: never-export
  (def food-journal
    [{:month 1 :day 1 :human 5.3 :critter 2,3}
     {:month 1 :day 2 :human 5.1 :critter 2.0}
     {:month 2 :day 1 :human 4.9 :critter 2.1}
     {:month 2 :day 2 :human 5.0 :critter 2.5}
     {:month 3 :day 1 :human 4.2 :critter 3.3}
     {:month 3 :day 2 :human 4.0 :critter 3.8}
     {:month 4 :day 1 :human 3.7 :critter 3.8}
     {:month 4 :day 2 :human 3.7 :critter 3.6}])
     #+end_src

with /take-while/, you can give retrieve just january's and february's data.
/take-while/ traverses the given sequence (in this case, /food-journal/),
applying the predicate function to each element.

this example use the anonymous function /#(< (:month %)3)/ to test whether the
journal entry's month is out of range:

#+begin_src clojure :result output :exports both eval: never-export
  (def food-journal1
    [{:month 1 :day 1 :human 5.3 :critter 2.3}
     {:month 1 :day 2 :human 5.1 :critter 2.0}
     {:month 2 :day 1 :human 4.9 :critter 2.1}
     {:month 2 :day 2 :human 5.0 :critter 2.5}
     {:month 3 :day 1 :human 4.2 :critter 3.3}
     {:month 3 :day 2 :human 4.0 :critter 3.8}
     {:month 4 :day 1 :human 3.7 :critter 3.9}
     {:month 4 :day 2 :human 3.7 :critter 3.6}])

  (take-while #(< (:month %)3) food-journal1)
#+end_src

#+results:
: ({:month 1, :day 1, :human 5.3, :critter 2.3}
: {:month 1, :day 2, :human 5.1, :critter 2.0}
: {:month 2, :day 1, :human 4.9, :critter 2.1}
: {:month 2, :day 2, :human 5.0, :critter 2.5})


when /take-while/ reaches the first march entry, the anonymous function return
false, and /take-while/ returns a sequence of every element it tested until that
point.

the same idea applies with /drop-while/ except that it keeps dropping elements
until one test true:

#+begin_src clojure :result output :exports both eval: never-export
  (def food-journal1
    [{:month 1 :day 1 :human 5.3 :critter 2.3}
     {:month 1 :day 2 :human 5.1 :critter 2.0}
     {:month 2 :day 1 :human 4.9 :critter 2.1}
     {:month 2 :day 2 :human 5.0 :critter 2.5}
     {:month 3 :day 1 :human 4.2 :critter 3.3}
     {:month 3 :day 2 :human 4.0 :critter 3.8}
     {:month 4 :day 1 :human 3.7 :critter 3.9}
     {:month 4 :day 2 :human 3.7 :critter 3.6}])

(drop-while #(< (:month %) 3) food-journal1)

#+end_src

#+results:
: ({:month 3, :day 1, :human 4.2, :critter 3.3}
: {:month 3, :day 2, :human 4.0, :critter 3.8}
: {:month 4, :day 1, :human 3.7, :critter 3.9}
: {:month 4, :day 2, :human 3.7, :critter 3.6})

by using /take-while/ and /drop-while/ together, you can get data for just
february and march:

#+begin_src clojure :result output :exports both eval: never-export
  (def food-journal1
    [{:month 1 :day 1 :human 5.3 :critter 2.3}
     {:month 1 :day 2 :human 5.1 :critter 2.0}
     {:month 2 :day 1 :human 4.9 :critter 2.1}
     {:month 2 :day 2 :human 5.0 :critter 2.5}
     {:month 3 :day 1 :human 4.2 :critter 3.3}
     {:month 3 :day 2 :human 4.0 :critter 3.8}
     {:month 4 :day 1 :human 3.7 :critter 3.9}
     {:month 4 :day 2 :human 3.7 :critter 3.6}])

  (take-while #(< (:month %) 4)
              (drop-while #(< (:month %) 2) food-journal1))

#+end_src

#+results:
: ({:month 2, :day 1, :human 4.9, :critter 2.1}
: {:month 2, :day 2, :human 5.0, :critter 2.5}
: {:month 3, :day 1, :human 4.2, :critter 3.3}
: {:month 3, :day 2, :human 4.0, :critter 3.8})

this example uses /drop-while/ to get rid of the january entries, and then it
uses /take-while/ on the result to keep taking entries until it reaches the
first april entry.

** filter and some

use /filter/ to return all elements of a sequence that test true for a predicate
function. here are the journal entries where human consumption is less that five
liters:

#+begin_src clojure :result output :exports both eval: never-export
  (def food-journal1
    [{:month 1 :day 1 :human 5.3 :critter 2.3}
     {:month 1 :day 2 :human 5.1 :critter 2.0}
     {:month 2 :day 1 :human 4.9 :critter 2.1}
     {:month 2 :day 2 :human 5.0 :critter 2.5}
     {:month 3 :day 1 :human 4.2 :critter 3.3}
     {:month 3 :day 2 :human 4.0 :critter 3.8}
     {:month 4 :day 1 :human 3.7 :critter 3.9}
     {:month 4 :day 2 :human 3.7 :critter 3.6}])

  (filter #(< (:human %) 5) food-journal1)
#+end_src

#+results:
: ({:month 2, :day 1, :human 4.9, :critter 2.1}
: {:month 3, :day 1, :human 4.2, :critter 3.3}
: {:month 3, :day 2, :human 4.0, :critter 3.8}
: {:month 4, :day 1, :human 3.7, :critter 3.9}
: {:month 4, :day 2, :human 3.7, :critter 3.6})

you might be wondering why we didn't just use /filter/ in the /take-while/ and
/drop-while/ examples earlier. indeed, /filter/ would work for that too. here
we're grabbing the january and february data, just like in the /take-while/
example:

#+begin_src clojure :result output :exports both eval: never-export
  (def food-journal1
    [{:month 1 :day 1 :human 5.3 :critter 2.3}
     {:month 1 :day 2 :human 5.1 :critter 2.0}
     {:month 2 :day 1 :human 4.9 :critter 2.1}
     {:month 2 :day 2 :human 5.0 :critter 2.5}
     {:month 3 :day 1 :human 4.2 :critter 3.3}
     {:month 3 :day 2 :human 4.0 :critter 3.8}
     {:month 4 :day 1 :human 3.7 :critter 3.9}
     {:month 4 :day 2 :human 3.7 :critter 3.6}])

  (filter #(< (:month %) 3) food-journal1)
#+end_src

#+results:
: ({:month 1, :day 1, :human 5.3, :critter 2.3}
: {:month 1, :day 2, :human 5.1, :critter 2.0}
: {:month 2, :day 1, :human 4.9, :critter 2.1}
: {:month 2, :day 2, :human 5.0, :critter 2.5})

this use is perfectly fine, but /filter/ can end up processing all of your data,
which isn't always necessary. because the food journal is already sorted by
date, we know that /take-while/ will return the data we want without having to
examine any of the data we won't need. therefore, /take-while/ can be more
efficient.

often, you want to know whether a collection contains any values that test true
for a predicate function. the /some/ function does that, returning the first
truthy value (any value that's not /false/ or /nil/) returned by a predicate
function:

#+begin_src clojure :result output :exports both eval: never-export
  (def food-journal1
    [{:month 1 :day 1 :human 5.3 :critter 2.3}
     {:month 1 :day 2 :human 5.1 :critter 2.0}
     {:month 2 :day 1 :human 4.9 :critter 2.1}
     {:month 2 :day 2 :human 5.0 :critter 2.5}
     {:month 3 :day 1 :human 4.2 :critter 3.3}
     {:month 3 :day 2 :human 4.0 :critter 3.8}
     {:month 4 :day 1 :human 3.7 :critter 3.9}
     {:month 4 :day 2 :human 3.7 :critter 3.6}])

  (some #(> (:critter %) 5) food-journal1)
#+end_src

#+results:
: nil

#+begin_src clojure :result output :exports both eval: never-export
  (def food-journal1
    [{:month 1 :day 1 :human 5.3 :critter 2.3}
     {:month 1 :day 2 :human 5.1 :critter 2.0}
     {:month 2 :day 1 :human 4.9 :critter 2.1}
     {:month 2 :day 2 :human 5.0 :critter 2.5}
     {:month 3 :day 1 :human 4.2 :critter 3.3}
     {:month 3 :day 2 :human 4.0 :critter 3.8}
     {:month 4 :day 1 :human 3.7 :critter 3.9}
     {:month 4 :day 2 :human 3.7 :critter 3.6}])

  (some #(> (:critter %) 3) food-journal1)
#+end_src

#+results:
: true

you don't have any food journal entries where you consumed more than five liters
from critter sources, but you do have at least one where you consumed more that
three liters. notice that the return value in the second example is /true/ and
not the actual entry that produced the true value. the reason is that the
anonymous function $#(> (:critter %) 3)$ returns /true/ or /false/. here's how
you could return the entry:

#+begin_src clojure :result output :exports both eval: never-export
  (def food-journal1
    [{:month 1 :day 1 :human 5.3 :critter 2.3}
     {:month 1 :day 2 :human 5.1 :critter 2.0}
     {:month 2 :day 1 :human 4.9 :critter 2.1}
     {:month 2 :day 2 :human 5.0 :critter 2.5}
     {:month 3 :day 1 :human 4.2 :critter 3.3}
     {:month 3 :day 2 :human 4.0 :critter 3.8}
     {:month 4 :day 1 :human 3.7 :critter 3.9}
     {:month 4 :day 2 :human 3.7 :critter 3.6}])

  (some #(and (> (:critter %) 3) %) food-journal1)
#+end_src

#+results:
: {:month 3, :day 1, :human 4.2, :critter 3.3}

here, a slightly different anonymous function /uses/ and to /first/ check
whether the condition $(> (:critter %) 3)$ is true, and then returns the entry
when the condition is indeed true.

** sort and sort-by

you can /sort/ elements in ascending order with /sort/:

#+begin_src clojure :result output :exports both eval: never-export
(sort [3 1 2])
#+end_src

#+results:
: (1 2 3)

if your sorting needs are more complicated, you can use /sort-by/, which allows
you to apply a function (sometimes called a /key function/) to the elements of
sequence and use the values it returns to determine the sort order. in the
following example, which is take from
https://clojuredocs.org/clojure.core/count, /count/ is the key function:

#+begin_src clojure :result output :exports both eval: never-export
(sort-by count ["aaa" "c" "bb"])
#+end_src

#+results:
: ("c" "bb" "aaa")

#+begin_src clojure :result output :exports both eval: never-export
(sort ["aaa" "c" "bb"])
#+end_src

#+results:
: ("aaa" "bb" "c")

if you were sorting using /sort/, the elements would be sorted in alphabetical
order, returning /("aaa" "bb" "c")/. instead, the result is /("c" "bb" "aaa")/
because you're sorting by /count/ and the count of /"c"/ is 1, "bb" is 2, and
"aaa" is 3.

** concat

finally, /concat/ simply appends the members of one sequence to the end of
another:

#+begin_src clojure :result output :exports both eval: never-export
  (concat [1 2] [3 4])
#+end_src

#+results:
: (1 2 3 4)

** demonstrating lazy seq efficiency

to see lazy seqs in action, pretend that you're part of modern-day task force
whose purpose is to identify vampires. your intelligence agents tell you that
there is only one active vampire in your city, and they've helpfully narrowed
down the list of suspects to a million people. your boss gives you a list of one
million social security numbers and shouts, "get it done, mcfishwich!".

thankfully, you are in possesion of a vampmatic 3000 computifier, the
state-of-the-art device for vampire identification. because the source code for
this vampire-hunting technology is proprietary. i've stubbed it out to simulate
the time it would take to perform this task. here is a subset of a vampire
database:

#+begin_src clojure :result output :exports both eval: never-export
  (def vampire-database
    {0 {:makes-blood-puns? false, :has-pulse? true  :name "mcfishwich"}
     1 {:makes-blood-puns? false, :has-pulse? true  :name "mcmackson"}
     2 {:makes-blood-puns? true,  :has-pulse? false :name "damon salvatore"}
     3 {:makes-blood-puns? true,  :has-pulse? true  :name "mickey mouse"}})

  (defn vampire-related-details
    [social-security-number]
    (thread/sleep 1000)
    (get vampire-database social-security-number))

  (defn vampire?
    [record]
    (and (:makes-blood-puns? record)
         (:not (:has-pulse? record))
         record))

  (defn identify-vampire
    [social-security-number]
    (first (filter vampire?
                   (map vampire-related-details social-security-number))))
#+end_src

you have a function, /vampire-related-details/, which takes one second to look
up an entry from the database. next, you have a function /vampire?/, which
returns a record if it passes the vampire test; otherwise, it returns /false/.
finally, /identify-vampire/ maps the first record that indicates vampirism.

to show how much time it takes to run these functions, you can use the time
operation. when you use /time/, your code behaves exactly as it would if you
didn't use /time/, but with one exception: a report of the elapsed time is
printed. here's an example:

#+begin_src clojure :result output :exports both eval: never-export
  (def vampire-database
    {0 {:makes-blood-puns? false, :has-pulse? true  :name "mcfishwich"}
     1 {:makes-blood-puns? false, :has-pulse? true  :name "mcmackson"}
     2 {:makes-blood-puns? true,  :has-pulse? false :name "damon salvatore"}
     3 {:makes-blood-puns? true,  :has-pulse? true  :name "mickey mouse"}})

  (defn vampire-related-details
    [social-security-number]
    (thread/sleep 1000)
    (get vampire-database social-security-number))

  (defn vampire?
    [record]
    (and (:makes-blood-puns? record)
         (:not (:has-pulse? record))
         record))

  (defn identify-vampire
    [social-security-number]
    (first (filter vampire?
                   (map vampire-related-details social-security-number))))

  (time (vampire-related-details 0))
#+end_src

#+results:
: "elapsed time: 1000.640251 msecs"
: {:makes-blood-puns? false, :has-pulse? true, :name "mcfishwich"}

the first printed line reports the time taken by the given operation--in this
case, 1000.640251 milliseconds. the second is the return value, which is your
database record in this case. the return value is exactly the same as it would
been if you hadn't used /time/.

a nonlazy implementation of /map/ would first have to apply
/vampire-related-details/ to every member of /social-security-number/ before
passing the result to /filter/. because you have one million suspects, this
would take one million seconds, or 12 days, and half your city would be dead by
then! of course, if it turns out that the only vampire is the last suspect in
the record, it will still take that much time with the lazy version, but at
least there's a good chance that it won't.

because /map/ is lazy, it doesn't actually apply /vampire-related-details/ to
social security numbers until you try to access the mapped element. in fact,
/map/ returns a value almost instantly:

#+begin_src clojure :result output :exports both eval: never-export
  (def vampire-database
    {0 {:makes-blood-puns? false, :has-pulse? true  :name "mcfishwich"}
     1 {:makes-blood-puns? false, :has-pulse? true  :name "mcmackson"}
     2 {:makes-blood-puns? true,  :has-pulse? false :name "damon salvatore"}
     3 {:makes-blood-puns? true,  :has-pulse? true  :name "mickey mouse"}})

  (defn vampire-related-details
    [social-security-number]
    (thread/sleep 1000)
    (get vampire-database social-security-number))

  (defn vampire?
    [record]
    (and (:makes-blood-puns? record)
         (:not (:has-pulse? record))
         record))

  (defn identify-vampire
    [social-security-number]
    (first (filter vampire?
                   (map vampire-related-details social-security-number))))

  (time (def mapped-details (map vampire-related-details (range 0 1000000))))
#+end_src

#+results:
: "elapsed time: 0.030287 msecs"
: #'user/mapped-details

in this example, /range/ returns a lazy sequence consisting of the integers from
0 to 999.999. then, /map/ returns a lazy sequence that is associated with the
name /mapped-details/. because /map/ didn't actually apply
/vampire-related-details/ to any of the elements returned by /range/, the entire
operation took barely any time--certainly less than 12 days.

you can think of a lazy seq as a consisting of two parts: a recipe for how to
realize the elements of a sequence and the elements that have been realized so
far. when you use /map/, the lazy seq it returns doesn't include any realized
elements yet, but it does have the recipe for generating its elements. every
time you try to access an unrealized element, the lazy seq will use its recipe
to generate the requested element.

in the previous example, /mapped-details/ is unrealized. once you try to access
a member of /mapped-details/, it will use its recipe to generate the element
you've requested, and you'll incur the /one-second-per-database-lookup/ cost:

#+begin_src clojure :result output :exports both eval: never-export
  (def vampire-database
    {0 {:makes-blood-puns? false, :has-pulse? true  :name "mcfishwich"}
     1 {:makes-blood-puns? false, :has-pulse? true  :name "mcmackson"}
     2 {:makes-blood-puns? true,  :has-pulse? false :name "damon salvatore"}
     3 {:makes-blood-puns? true,  :has-pulse? true  :name "mickey mouse"}})

  (defn vampire-related-details
    [social-security-number]
    (thread/sleep 1000)
    (get vampire-database social-security-number))

  (defn vampire?
    [record]
    (and (:makes-blood-puns? record)
         (:not (:has-pulse? record))
         record))

  (defn identify-vampire
    [social-security-number]
    (first (filter vampire?
                   (map vampire-related-details social-security-number))))

  (def mapped-details (map vampire-related-details (range 0 1000000)))

  (time (first mapped-details))
#+end_src

#+results:
: "elapsed time: 32010.491347 msecs"
: {:makes-blood-puns? false, :has-pulse? true, :name "mcfishwich"}


this operation took about 32 seconds. that's much better than one million
seconds, but this is still 31 seconds more than we would have expected. after
all, you're only trying to access the very first element, so it should have
taken only one second.

the reason it took 32 seconds is that clojure /chunks/ its lazy sequences, which
just means that whenever clojure has to realize an element, it preemptively
realize some of the next element of /mapped-details/, but clojure went ahead and
prepared the next 31 as well. clojure does this because it almost always result
in better performance.

thankfully, lazy seq elements need to be realized only once. accessing the first
element of /mapped-details/ again takes almost no time

#+begin_src clojure :result output :exports both eval: never-export
  (time (first mapped-details))
#+end_src

: "elapsed time: 0.028961 msecs"
: =>{:makes-blood-puns? false, :has-pulse? true, :name "mcfishwich"}

with all this newfound knowledge, you can efficiently mine the vampire database
to find the fanged culprit:

#+begin_src clojure :result output :exports both eval: never-export
  (time (identify-vampire (range 0 1000000)))
#+end_src

: "elapsed time: 32019.912 msecs"
: =>{:makes-blood-puns? true, :has-pulse? false, :name "damon salvatore"}

** infinite sequences

one cool, useful capability that lazy seqs give you is the ability to construct
infinite sequences. so far, you've only worked with lazy sequences generated
from vectors or lists that terminated. however, clojure comes with a few
functions to create infinite sequences. one easy way to create an infinite
sequence is with /repeat/, which creates a sequence whose every members is the
argument you pass:

#+begin_src clojure :result output :exports both eval: never-export
(concat (take 8 (repeat "na")) ["batman!"])
#+end_src

#+results:
: ("na" "na" "na" "na" "na" "na" "na" "na" "batman!")

in this case, you create an infinite sequence whose every element is the string
/"na"/, then use that to construct a sequence that may or not provoke nostalgia.

you can also use /repeatedly/, which will call the provided function to generate
each element in the sequence:

#+begin_src clojure :result output :exports both eval: never-export
(take 3 (repeatedly (fn [] (rand-int 10))))
#+end_src

#+results:
: (2 0 3)

here, the lazy sequence returned by /repeatedly/ generates every new element by
calling the anonymous function $(fn [] (rand-int 10))$, which returns a random
integer between 0 and 9. if you run this in your repl, your result will most
likely be different from this one.

a lazy seq's recipe doesn't have to specify an endpoint. functions like /first/
and /take/ which realize the lazy seq, have no way of knowing what will come
next in a seq, and if the seq keep providing elements, well, they'll just keep
taking them. you can see this if you construct your own infinite sequence.

#+begin_src clojure :result output :exports both eval: never-export
  (defn even-numbers
    ([] (even-numbers 0))
    ([n] (cons n (lazy-seq (even-numbers (+ n 2))))))

  (take 10 (even-numbers))
#+end_src

#+results:
: (0 2 4 6 8 10 12 14 16 18)

this example is a bit mind-bending because of its use of recursion. it helps to
remember that /cons/ returns a new list with an element appended to he given
list:

#+begin_src clojure :result output :exports both eval: never-export
(cons 0 '(2 4 6))
#+end_src

#+results:
: (0 2 4 6)

(incidentally, lisp programmers call it /consing[fn:2]/ when they use the /cons/
function.)

in /even-numbers/, you're consing to a lazy list, which includes a recipe (a
function) for the next element (as opposed to consing to a fully realized list).

and that covers lazy seq! now you know everything there is to know about
sequence abstraction, and we can turn to the collection abstraction.

** into

one of the most important collection function is /into/. as you now know, many
seq functions return a seq rather than the original data structure. you'll
probably want to convert the return value back into the original value, and
/into/ lets you do that:

#+begin_src clojure :result output :exports both eval: never-export
(map identity {:sunlight-reaction "glitter"})
#+end_src

#+results:
: ([:sunlight-reaction "glitter"])

#+begin_src clojure :result output :exports both eval: never-export
(into {} (map identity {:sunlight-reaction "glitter"}))
#+end_src

#+results:
: {:sunlight-reaction "glitter"}

here, the /map/ function returns a sequential data structure after being given a
map data structure, and into converts the seq back into a map.

this will work with other data structure as well:

#+begin_src clojure :result output :exports both eval: never-export
(map identity [:garlic :sesame-oil :fried-eggs])
#+end_src

#+results:
: (:garlic :sesame-oil :fried-eggs)

#+begin_src clojure :result output :exports both eval: never-export
(into [] (map identity [:garlic :sesame-oil :fried-eggs]))
#+end_src

#+results:
: [:garlic :sesame-oil :fried-eggs]

here, the first line, /map/ return a seq, and we use /into/ in the second line
to covert the result back to a vector.

in the following example, we start with a vector with two identical entries,
/map/ converts it to a list, and then we use /into/ to stick the value into a
set.

#+begin_src clojure :result output :exports both eval: never-export
(map identity [:garlic-clove :garlic-clove])
#+end_src

#+results:
: (:garlic-clove :garlic-clove)

#+begin_src clojure :result output :exports both eval: never-export
(into #{} (map identity [:garlic-clove :garlic-clove]))
#+end_src

#+results:
: #{:garlic-clove}

because sets only contain unique values, the set ends up with just one value.

the first argument of /into/ doesn't have to be empty. here, the first example
shows how you can use /into/ to add elements to a map, and second shows how you
can add elements to a vector.

#+begin_src clojure :result output :exports both eval: never-export
(into {:favorite-emotion "gloomy"} [[:sunlight-reaction "glitter!"]])
#+end_src

#+results:
: {:favorite-emotion "gloomy", :sunlight-reaction "glitter!"}

#+begin_src clojure :result output :exports both eval: never-export
(into ["cherry"] '("pine" "spruce"))
#+end_src

#+results:
: ["cherry" "pine" "spruce"]

and, of course, both arguments can be the same type. in this next example, both
arguments are maps, whereas all the previous examples had arguments of different
types. it works as you'd expect, returning a new map with the elements of the
second map added to the first:

#+begin_src clojure :result output :exports both eval: never-export
  (into {:favorite-animal "kitty"} {:least-favorite-smell "dog"
                                    :relationship-with-teenager "creepy"})
#+end_src

#+results:
: {:favorite-animal "kitty",
: :least-favorite-smell "dog",
: :relationship-with-teenager "creepy"}

if /into/ asked to describe its strengths at a job interview, it would say. "i'm
great at taking two collection and adding all the elements from the second to
the first."

** conj

/conj/ also adds elements to a collection, but it does it in a slightly
different way:

#+begin_src clojure :result output :exports both eval: never-export
(conj [0] [1])
#+end_src

#+results:
: [0 [1]]

whoopsie! looks like it added the entire vector $[1]$ to $[0]$. compare this
with /into/:

#+begin_src clojure :result output :exports both eval: never-export
(into [0] [1])
#+end_src

#+results:
: [0 1]

notice that the number 1 is passed as a scalar (singular, non-collection) value,
whereas /into/'s second argument must be a collection.

you can supply as many elements to add with /conj/ as you want, and you can also
add to other collections like maps:

#+begin_src clojure :result output :exports both eval: never-export
(conj [0] 1 2 3 4)
#+end_src

#+results:
: [0 1 2 3 4]

#+begin_src clojure :result output :exports both eval: never-export
(conj {:time "midnight"} [:place "ye olde cemetarium"])
#+end_src

#+results:
: {:time "midnight", :place "ye olde cemetarium"}

/conj/ and /into/ are similar that you could even define /conj/ in term of
/into/:

#+begin_src clojure :result output :exports both eval: never-export
  (defn my-conj
    [target & additions]
    (into target additions))

  (my-conj [0] 1 2 3)

  ;; => [0 1 2 3]
#+end_src

This kind of pattern isn't that uncommon. You'll often see two functions that do
the same thing, except one takes a rest parameter (/conj/) and one take seqable
data structure (/into/).

#+begin_src clojure :result output :exports both eval: never-export
  (defn my-conj
    [target & additions]  ;; see the '&'
    (into target additions))

  (my-conj [0 1])

  ;; => [0 1]
#+end_src

In Clojure, the symbol $&$ is used in a function definition to indicate that the
parameter following it can accepts a variable number of arguments. This known as
a "variadic[fn:3]" function.

In the function definition $[target & additions]$, the number of arguments is
counted as follows:

  1. $target$: This is a required argument. You must provide one value for
     $target$ when callind the function.

  2. $& additions$: This allows for a variable number of additional arguments.
     You can provide zero or more arguments for $additions$.

